{"/nextannouncers/":{"data":{"":"Introduction Configuration"},"title":"NextAnnouncers"},"/nextannouncers/command/":{"data":{"":"You can use the command below to reload the announcers!","commands#Commands":"\u003c\u003e = Required [] = Optional\n/nextannouncers /nextannouncers"},"title":"Commands"},"/nextannouncers/config/":{"data":{"":"You can configure the plugin in the config.yml file. according to your needs! And it’s very customizeable from the blacklist server to even adding more broadcast!","configuration-section#Configuration Section":"config.yaml# You can set the interval of every announcers in seconds # Default: 10 seconds announcer-interval: 10 # Blacklist a list of servers that's players should not see the announcers # Default: [] blacklist-servers: [] # You can disable the announcers by setting this to false # Default: true announcers-enabled: true # You can add as many announcers as you want # Just add a new section with a unique id announcers: 1: # This must be a unique id and it must be a number! # You can add as many messages as you want # Just add a new line with a message # You can use color codes and hex colors # Example: \u0026aHello World! or \u0026#RRGGBBHello World! messages: - \"\u0026aHello World!\" - \"\u0026aThis is a test!\" # You can add as many sounds as you want # Just add a new line with a sound # You can use any sound from the minecraft namespace # Example: minecraft:block.note_block.pling;0.5;1.0 # delimiter are ; sounds: - \"minecraft:block.note_block.pling;0.5;1.0\" You can also change the language of the plugin in the lang.yml file. Everything is customizable from the prefix to the messages!","language-section#Language Section":"lang.yamlmessages: prefix: \" \u0026a[\u0026bNextAnnouncers\u0026a]\" reload: \"{prefix} \u0026aThe announcers has been reloaded!\" help: \"{prefix} \u0026a/nextannouncers reload \u00267- \u0026fReload the announcers\""},"title":"Configuration"},"/nextannouncers/introduction/":{"data":{"":"Welcome to the documentation of NextAnnouncers! A quick and optimized repeatable broadcast(announcers) to help server owner that has multiple server and doesn’t want to change each backend broadcast everytime.\nNextAnnouncers is a plugin designed for Server Owners that has too many backends broadcast making it quite a hassle to edit each one. But this plugin does it all in a single instance without any hassle whatsoever!","commands#Commands":"\u003c\u003e = Required [] = Optional\n/nextannouncers /nextannouncers","features#Features":"Easy to use Repeatable Broadcast to all backends server Blacklist Server Playsound to all backends server Adjustable interval Customizeable Settings Customizeable Language Settings Turn on / off announcers","permissions#Permissions":"nextannouncers.reload","supported-backends#Supported Backends":"Velocity"},"title":"Introduction"},"/nextannouncers/permission/":{"data":{"":"You can give your staff or admins to reload the announcers by giving them the permission below here!","permissions#Permissions":"nextannouncers.reload - Reload the announcers"},"title":"Permissions"},"/nextcollectors/":{"data":{"":"Introduction Configuration Permissions Commands Placeholder Dependencies"},"title":"NextCollectors"},"/nextcollectors/command/":{"data":{"":"You can use these commands to manage your chunk collectors!","commands#Commands":"\u003c\u003e = Required [] = Optional\n/nextcollectors /nextcollector /chunkcollectors /chunkcollector /collectors /collector Subcommand Description isAdmin trust trust certain member to access your chunk collector false untrust untrust certain member from accessing your chunk collector false pickupall [player] pickup all of your chunk collectors true/false give [amount] give chunk collector to player true addmax [amount] add max chunk collectors to player true removemax [amount] remove max chunk collectors from player true setmax [amount] set max chunk collectors for player true reload reload the configuration true"},"title":"Commands"},"/nextcollectors/dependencies/":{"data":{"":"You can use these plugins to enhance the functionality of NextCollectors!","dependencies#Dependencies":"Plugin Description Required Vault Use to give/take money Yes DecentHolograms Use to display holograms for chunk collectors. Only one hologram provider plugin needed FancyHolograms Use to display holograms for chunk collectors. Only one hologram provider plugin needed WildStacker Make chunk collectors able to collect stacked item from this plugin. No RoseStacker Make chunk collectors able to collect stacked item from this plugin. No Essentials Use to provide worth/pricing of items in-game. No ShopGUIPlus Use to provide worth/pricing of items in-game. No PlaceholderAPI Use to create a placeholders that can be used externally, more info at Placeholders No"},"title":"Dependencies"},"/nextcollectors/introduction/":{"data":{"":"","features#Features":"Transaction Logs: Keep track of all collector-related transactions for better transparency and management. Auto Sell Upgrade: Boost efficiency by enabling automatic selling of collected items directly from the chunk collector. ️Interactive GUI: Navigate and manage chunk collectors effortlessly with a user-friendly graphical interface. Flexible Item Retrieval: Retrieve items seamlessly—grab one, a stack, or all at once. Performance Optimized: Engineered for large-scale servers, ensuring zero lag and maximum efficiency. Shop Integration: Fully compatible with EssentialsX, ShopGUIPlus, or built-in shop systems for seamless transactions. Hologram Support: Displays collectors’ status using DecentHolograms or FancyHolograms for a polished, interactive experience. PlaceholderAPI Expansion: Show players their maximum allowable chunk collectors for a dynamic, customizable experience. ️Fully Configurable: Tailor every feature to suit your server’s unique needs. Stacked Item Support: Compatible with stacked items from WildStacker and RoseStacker plugins. Trust System: Grant or revoke access to chunk collectors with trust/untrust commands for enhanced security. Whether you’re running a small private server or a massive network, this plugin delivers unparalleled functionality and flexibility. Say goodbye to tedious item collection and hello to streamlined, efficient gameplay for your players!​","supported-platform#Supported Platform":"Paper Bukkit Spigot Purpur Pufferfish","what-is-nextcollectors#What is NextCollectors?":"NextCollectors is a plugin designed to Revolutionize item collection and management on your Minecraft server with our feature-packed Chunk Collector Plugin! Designed for performance, scalability, and ease of use, this plugin is your perfect solution for streamlined automation. Here’s what sets it apart:"},"title":"Introduction"},"/nextcollectors/permission/":{"data":{"":"Permission Description nextcollectors.admin To perform various admin-related actions, such as: executing admin commands, access others chunk collector without access nextcollectors.pickupall To access / pickupall command nextcollectors.pickupall.others To access / pickupall command nextcollectors.trust To access / trust and / untrust command"},"title":"Permissions"},"/nextcollectors/placeholder/":{"data":{"":"Requires PlaceholderAPI to work!","placeholder#Placeholder":"Placeholder Description %nextcollectors_current% Show how many chunk collectors that player has placed. %nextcollectors_max% Show how many chunk collectors that the player can place."},"title":"Placeholder"}}